SELECT "Н_ЛЮДИ"."ИМЯ", "Н_СЕССИЯ"."ЧЛВК_ИД" FROM "Н_ЛЮДИ" RIGHT OUTER JOIN "Н_СЕССИЯ"
    ON ("Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД")
    WHERE ("Н_ЛЮДИ"."ИД" < 142095 AND "Н_СЕССИЯ"."ИД" > 32199);

SELECT "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ИД" ,"Н_СЕССИЯ"."ДАТА" FROM "Н_ЛЮДИ"
    INNER JOIN "Н_ВЕДОМОСТИ" ON ("Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД")
    INNER JOIN "Н_СЕССИЯ" ON ("Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД")
    WHERE ("Н_ЛЮДИ"."ИД" > 163484 AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 105590);

SELECT count(*) FROM "Н_УЧЕНИКИ"
  INNER JOIN "Н_ПЛАНЫ" ON ("Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД")
  INNER JOIN "Н_ЛЮДИ" ON ("Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
  WHERE ("Н_ПЛАНЫ"."ОТД_ИД" = 703 AND "Н_ЛЮДИ"."ИНН" IS NULL);

SELECT "ГРУППА" FROM (SELECT "Н_УЧЕНИКИ"."ГРУППА", count(*) FROM "Н_УЧЕНИКИ"
  INNER JOIN "Н_ПЛАНЫ" ON ("Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД")
  WHERE ("Н_ПЛАНЫ"."ОТД_ИД_ЗАКРЕПЛЕН_ЗА" = 102 AND "Н_ПЛАНЫ"."УЧЕБНЫЙ_ГОД" LIKE '%2011%')
  GROUP BY "Н_УЧЕНИКИ"."ГРУППА" HAVING count(*) = 5) ss;

SELECT "Н_УЧЕНИКИ"."ГРУППА",
  round (cast(AVG(DATE_PART('years', age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))) AS NUMERIC), 2) AS "СРЕДНИЙ_ВОЗРАСТ"
  FROM "Н_УЧЕНИКИ"
  INNER JOIN "Н_ЛЮДИ" ON ("Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
GROUP BY "Н_УЧЕНИКИ"."ГРУППА"
HAVING AVG(DATE_PART('years', age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))) <
       (SELECT AVG(DATE_PART('years', age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))) FROM "Н_УЧЕНИКИ"
       INNER JOIN "Н_ЛЮДИ" ON ("Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
       WHERE "Н_УЧЕНИКИ"."ГРУППА"='1101');

SELECT * FROM (SELECT "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_УЧЕНИКИ"."В_СВЯЗИ_С"
  FROM "Н_ЛЮДИ"
  INNER JOIN "Н_УЧЕНИКИ" ON ("Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
  INNER JOIN "Н_ПЛАНЫ" ON ("Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД")
  INNER JOIN "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" ON ("Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД")
  INNER JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON ("Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД")
  WHERE ("Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД" = 741 AND "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД" = 3
          AND "Н_УЧЕНИКИ"."ПРИЗНАК" = 'отчисл' AND
         ("Н_УЧЕНИКИ"."КОНЕЦ" > '2012-08-30' AND "Н_УЧЕНИКИ"."КОНЕЦ" < '2012-09-02'))) ss WHERE EXISTS(SELECT 1 FROM "Н_ЛЮДИ");

SELECT count(*) FROM (SELECT "Н_ЛЮДИ"."ИД", count(*) AS "КОЛИЧЕСТВО_ТРОЕК" FROM "Н_ЛЮДИ"
      INNER JOIN "Н_ВЕДОМОСТИ" ON ("Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
      WHERE ("Н_ВЕДОМОСТИ"."ОЦЕНКА" = '3' AND "Н_ВЕДОМОСТИ"."СОСТОЯНИЕ" = 'актуальна')
      GROUP BY "Н_ЛЮДИ"."ИД") ss
      WHERE ("КОЛИЧЕСТВО_ТРОЕК" >= 1);