SELECT "Н_ЛЮДИ"."ИМЯ", "Н_СЕССИЯ"."УЧГОД" FROM "Н_ЛЮДИ"
    INNER JOIN "Н_СЕССИЯ" ON ("Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД")
    WHERE ("Н_ЛЮДИ"."ИМЯ" = 'Александр' AND "Н_СЕССИЯ"."ЧЛВК_ИД" = 100012);

SELECT "Н_ЛЮДИ"."ИД", "Н_ВЕДОМОСТИ"."ДАТА" ,"Н_СЕССИЯ"."ЧЛВК_ИД" FROM "Н_ЛЮДИ"
    RIGHT OUTER JOIN "Н_ВЕДОМОСТИ" ON ("Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД")
    RIGHT OUTER JOIN "Н_СЕССИЯ" ON ("Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД")
    WHERE ("Н_ЛЮДИ"."ФАМИЛИЯ" < 'Соколов' AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 142390
    AND "Н_СЕССИЯ"."ИД" = 27640);
	
EXPLAIN ANALYZE SELECT "Н_ЛЮДИ"."ИМЯ", "Н_СЕССИЯ"."УЧГОД" FROM "Н_ЛЮДИ"
    INNER JOIN "Н_СЕССИЯ" ON ("Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД")
    WHERE ("Н_ЛЮДИ"."ИМЯ" = 'Александр' AND "Н_СЕССИЯ"."ЧЛВК_ИД" = 100012);

EXPLAIN ANALYZE SELECT "Н_ЛЮДИ"."ИД", "Н_ВЕДОМОСТИ"."ДАТА" ,"Н_СЕССИЯ"."ЧЛВК_ИД" FROM "Н_ЛЮДИ"
    RIGHT OUTER JOIN "Н_ВЕДОМОСТИ" ON ("Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД")
    RIGHT OUTER JOIN "Н_СЕССИЯ" ON ("Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД")
    WHERE ("Н_ЛЮДИ"."ФАМИЛИЯ" < 'Соколов' AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 142390
    AND "Н_СЕССИЯ"."ИД" = 27640);